#ifndef Z2WOLFHOWLMGR_H
#define Z2WOLFHOWLMGR_H

#include "Z2SoundObject.h"

struct Z2WolfHowlData {};

class Z2WolfHowlMgr {
public:
    /* 0x00 */ JAISoundHandle* field_0x00;
    /* 0x04 */ JAISoundHandle* field_0x04;
    /* 0x08 */ JAISoundHandle* field_0x08;
    /* 0x0C */ Z2WolfHowlData* field_0x0c;
    /* 0x10 */ void* field_0x10;
    /* 0x14 */ float mNowInputValue;
    /* 0x18 */ float field_0x18;
    /* 0x1C */ float field_0x1c;
    /* 0x20 */ float field_0x20;
    /* 0x24 */ float field_0x24;
    /* 0x28 */ float field_0x28;
    /* 0x2C */ uint8_t field_0x2c[4];
    /* 0x30 */ float field_0x30;
    /* 0x34 */ float field_0x34;
    /* 0x38 */ float field_0x38;
    /* 0x3C */ float field_0x3c;
    /* 0x40 */ float field_0x40;
    /* 0x44 */ float field_0x44;
    /* 0x48 */ float field_0x48;
    /* 0x4C */ float field_0x4c;
    /* 0x50 */ float field_0x50;
    /* 0x54 */ float field_0x54;
    /* 0x58 */ float field_0x58;
    /* 0x5C */ float field_0x5c;
    /* 0x60 */ float field_0x60;
    /* 0x64 */ float field_0x64;
    /* 0x68 */ float field_0x68;
    /* 0x6C */ float field_0x6c;
    /* 0x70 */ float field_0x70;
    /* 0x74 */ float field_0x74;
    /* 0x78 */ float field_0x78;
    /* 0x7C */ float field_0x7c;
    /* 0x80 */ float field_0x80;
    /* 0x84 */ float field_0x84;
    /* 0x88 */ void* mTimer;
    /* 0x8C */ uint8_t mReleaseTimer;
    /* 0x8D */ uint8_t field_0x8d;
    /* 0x8E */ uint8_t mCorrectCurveID;
    /* 0x8F */ uint8_t field_0x8f;
    /* 0x90 */ int16_t field_0x90;
    /* 0x92 */ uint8_t field_0x92[20];
    /* 0xA6 */ uint8_t field_0xa6[0x14];
    /* 0xBA */ uint8_t field_0xba;
    /* 0xBB */ uint8_t field_0xbb;
    /* 0xBC */ uint8_t field_0xbc;
};

#endif /* Z2WOLFHOWLMGR_H */
